# CLI tools
brew "bat"                                         # replacement for cat. Syntax highlighting, git integration, and more.
brew "chezmoi"                                     # Manage your dotfiles across multiple machines, securely and easily.
brew "direnv"                                      # Load/unload environment variables based on the current directory.
brew "eza"                                         # A modern, maintained replacement for ls.
brew "fzf"                                         # A command-line fuzzy finder.
brew "gh"                                          # GitHub CLI.
brew "ghq"                                         # Manage your GitHub repositories locally.
brew "git-secret"                                  # A tool for storing encrypted secrets in git repositories.
brew "gnupg"                                       # A complete implementation of the OpenPGP standard.
brew "hgrep"                                       # A fast, simple grep-like tool.
brew "mise"                                        # Manage runtime versions for multiple languages.
brew "navi"                                        # An interactive cheatsheet tool.
brew "starship"                                    # The minimal, blazing-fast, and infinitely customizable prompt for any shell.
brew "tealdeer"                                    # A fast, simple tldr client.
brew "topgrade"                                    # Upgrade everything.
brew "zsh-autosuggestions"                         # Fish-like autosuggestions for zsh.
brew "zsh-syntax-highlighting"                     # Syntax highlighting for the zsh shell.

# GUI apps (cask)
cask "1password"                                   # A password manager that keeps all your passwords secure and accessible.
cask "claude"                                      # AI chat application.
cask "clipy"                                       # A clipboard manager.
cask "cmux"                                        # A terminal multiplexer.
cask "dbeaver-community"                           # A free multi-platform database tool.
cask "docker-desktop"                              # Docker Desktop for Mac.
cask "figma"                                       # A collaborative interface design tool.
cask "gcloud-cli"                                  # Google Cloud SDK.
cask "ghostty"                                     # A modern terminal emulator.
cask "google-japanese-ime"                         # Google Japanese Input Method.
cask "font-inconsolata-g-for-powerline"            # Inconsolata font for Powerline.
cask "karabiner-elements"                          # A powerful keyboard customizer.
cask "notion"                                      # A collaborative workspace.
cask "pika"                                        # Color ratio difference checker.
cask "raycast"                                     # A fast launcher for macOS.
cask "slack"                                       # A team communication tool.
cask "touchdesigner"                               # A visual development environment.
cask "visual-studio-code"                          # A source-code editor.
cask "vivaldi"                                     # A web browser.
cask "zoom"                                        # A video conferencing tool.
