# CLI tools
brew "bat"
brew "chezmoi"
brew "direnv"
brew "eza"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-secret"
brew "gnupg"
brew "hgrep"
brew "navi"
brew "starship"
brew "tealdeer"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# GUI apps (cask)
cask "1password"
cask "claude"
cask "clipy"
cask "dbeaver-community"
cask "docker-desktop"
cask "gcloud-cli"
cask "ghostty"
cask "google-japanese-ime"
cask "font-inconsolata-g-for-powerline"
cask "karabiner-elements"
cask "notion"
cask "pika"
cask "raycast"
cask "slack"
cask "touchdesigner"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"
